Revit 2024 API
BuiltInFailures.GeometryFailures.SymbolicLineInvalidPlane Property
 Symbolic Element refers to a Work Plane with unacceptable normal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SymbolicLineInvalidPlane { get; }
Visual Basic
Public Shared ReadOnly Property SymbolicLineInvalidPlane As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SymbolicLineInvalidPlane {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace